Ran Plan for project: `animeutopia-prod` dir: `accounts/animeutopia-prod` workspace: `default`

<details><summary>Show Output</summary>

```diff
Wrote /home/atlantis/.atlantis/prod-ue2-animeutopia.tfvars with secrets from SSM.
Wrote /home/atlantis/.atlantis/nonprod-ue2-animeutopia.tfvars with secrets from SSM.
Wrote /home/atlantis/.atlantis/prod-ue2-sharedservices.tfvars with secrets from SSM.
Wrote /home/atlantis/.atlantis/nonprod-ue2-sharedservices.tfvars with secrets from SSM.


Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+ create
~ update in-place

Terraform will perform the following actions:

  # aws_iam_role_policy.step_functions_policy will be updated in-place
~ resource "aws_iam_role_policy" "step_functions_policy" {
        id          = "anime_step_functions_role:anime_step_functions_policy"
        name        = "anime_step_functions_policy"
      ~ policy      = jsonencode(
            {
              - Statement = [
                  - {
                      - Action   = [
                          - "lambda:InvokeFunction",
                        ]
                      - Effect   = "Allow"
                      - Resource = [
                          - "arn:aws:lambda:us-east-2:481665084477:function:fetch_rss",
                          - "arn:aws:lambda:us-east-2:481665084477:function:process_content",
                          - "arn:aws:lambda:us-east-2:481665084477:function:store_data",
                          - "arn:aws:lambda:us-east-2:481665084477:function:render_video",
                          - "arn:aws:lambda:us-east-2:481665084477:function:notify_post",
                        ]
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
        # (2 unchanged attributes hidden)
    }

  # aws_lambda_function.render_video will be created
+ resource "aws_lambda_function" "render_video" {
      + architectures                  = (known after apply)
      + arn                            = (known after apply)
      + code_sha256                    = (known after apply)
      + function_name                  = "render_video"
      + id                             = (known after apply)
      + image_uri                      = "481665084477.dkr.ecr.us-east-2.amazonaws.com/render_video_repo:latest"
      + invoke_arn                     = (known after apply)
      + last_modified                  = (known after apply)
      + memory_size                    = 128
      + package_type                   = "Image"
      + publish                        = false
      + qualified_arn                  = (known after apply)
      + qualified_invoke_arn           = (known after apply)
      + reserved_concurrent_executions = -1
      + role                           = "arn:aws:iam::481665084477:role/anime_lambda_role"
      + signing_job_arn                = (known after apply)
      + signing_profile_version_arn    = (known after apply)
      + skip_destroy                   = false
      + source_code_hash               = (known after apply)
      + source_code_size               = (known after apply)
      + tags_all                       = {
          + "DeployedBy" = "Terraform"
        }
      + timeout                        = 180
      + version                        = (known after apply)

      + environment {
          + variables = {
              + "FFMPEG_PATH"   = "/opt/bin/ffmpeg"
              + "TARGET_BUCKET" = "prod-animeutopia-media-bucket"
            }
        }

      + ephemeral_storage (known after apply)

      + logging_config (known after apply)

      + tracing_config (known after apply)
    }

  # aws_sfn_state_machine.anime_workflow will be updated in-place
~ resource "aws_sfn_state_machine" "anime_workflow" {
      ~ definition                = jsonencode(
            {
              - Comment = "State machine for automating anime post workflow with MoviePy"
              - StartAt = "FetchRSS"
              - States  = {
                  - CheckPost      = {
                      - Choices = [
                          - {
                              - Next         = "ProcessContent"
                              - StringEquals = "anime_post_found"
                              - Variable     = "$.rssData.status"
                            },
                        ]
                      - Default = "EndWorkflow"
                      - Type    = "Choice"
                    }
                  - EndWorkflow    = {
                      - Type = "Succeed"
                    }
                  - FetchRSS       = {
                      - Next       = "CheckPost"
                      - Resource   = "arn:aws:lambda:us-east-2:481665084477:function:fetch_rss"
                      - ResultPath = "$.rssData"
                      - Type       = "Task"
                    }
                  - NotifyUser     = {
                      - End        = true
                      - Resource   = "arn:aws:lambda:us-east-2:481665084477:function:notify_post"
                      - ResultPath = "$.notificationResult"
                      - Type       = "Task"
                    }
                  - ProcessContent = {
                      - Next       = "StoreData"
                      - Resource   = "arn:aws:lambda:us-east-2:481665084477:function:process_content"
                      - ResultPath = "$.processedContent"
                      - Type       = "Task"
                    }
                  - RenderVideo    = {
                      - Next       = "NotifyUser"
                      - Resource   = "arn:aws:lambda:us-east-2:481665084477:function:render_video"
                      - ResultPath = "$.videoResult"
                      - Type       = "Task"
                    }
                  - StoreData      = {
                      - Next       = "RenderVideo"
                      - Resource   = "arn:aws:lambda:us-east-2:481665084477:function:store_data"
                      - ResultPath = "$.storeResult"
                      - Type       = "Task"
                    }
                }
            }
        ) -> (known after apply)
        id                        = "arn:aws:states:us-east-2:481665084477:stateMachine:anime_workflow"
        name                      = "anime_workflow"
        tags                      = {}
        # (11 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

Plan: 1 to add, 2 to change, 0 to destroy.
```
</details>

* :arrow_forward: To **apply** this plan, comment:
  ```shell
  atlantis apply -p animeutopia-prod
  ```
* :put_litter_in_its_place: To **delete** this plan and lock, click [here](http://18.217.82.45:4141/lock?id=ryan-longoria%252FFeedMatrix%252Faccounts%252Fanimeutopia-prod%252Fdefault)
* :repeat: To **plan** this project again, comment:
  ```shell
  atlantis plan -p animeutopia-prod
  ```
Plan: 1 to add, 2 to change, 0 to destroy.

---
* :fast_forward: To **apply** all unapplied plans from this Pull Request, comment:
  ```shell
  atlantis apply
  ```
* :put_litter_in_its_place: To **delete** all plans and locks from this Pull Request, comment:
  ```shell
  atlantis unlock
  ```